app/controllers/logins_controller.rb

  def create

    user = User.find_by(email:login_params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'a@a.com' LIMIT 1