app/controllers/registrations_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('test', 'test@test.com', '$2a$12$Ud.fp5SxVkihHqZVfGKXSeGQ9Y28LTZN4YKxf2RKnjqn0T.QQU8pi', '2022-02-04 05:09:57.317522', '2022-02-04 05:09:57.317522')